import {Points} from '../types/map';

export const POINTS: Points = [
  {
    city: 'Paris',
    markers: [
      {
        title: 'Поинт 1',
        lat: 52.3909553943508,
        lng: 4.85309666406198
      },
      {
        title: 'Поинт 2',
        lat: 52.369553943508,
        lng: 4.85309666406198
      },
      {
        title: 'Поинт 3',
        lat: 52.3909553943508,
        lng:  4.929309666406198
      },
      {
        title: 'Поинт 4',
        lat: 52.3809553943508,
        lng: 4.939309666406198
      },
    ],
  },
  {
    city: 'Cologne',
    markers: [
      {
        title: 'Поинт 1',
        lat: 52.3909753943508,
        lng: 4.85309666406198
      },
      {
        title: 'Поинт 2',
        lat: 52.369553943508,
        lng: 4.85309666406198
      },
      {
        title: 'Поинт 3',
        lat: 52.3909553943508,
        lng:  4.929303666406198
      },
      {
        title: 'Поинт 4',
        lat: 52.3809553943508,
        lng: 4.939354666406198
      },
    ],
  },
  {
    city: 'Brussels',
    markers: [
      {
        title: 'Поинт 1',
        lat: 52.3909553443508,
        lng: 4.85309666403198
      },
      {
        title: 'Поинт 2',
        lat: 52.369523943508,
        lng: 4.81309666406198
      },
      {
        title: 'Поинт 3',
        lat: 52.3909554943508,
        lng:  4.929309669406198
      },
      {
        title: 'Поинт 4',
        lat: 52.3809053943508,
        lng: 4.934309666406198
      },
    ],
  },
  {
    city: 'Amsterdam',
    markers: [
      {
        title: 'Поинт 1',
        lat: 52.3909553943528,
        lng: 4.85307666406198
      },
      {
        title: 'Поинт 2',
        lat: 52.369553343508,
        lng: 4.85309066406198
      },
      {
        title: 'Поинт 3',
        lat: 52.3909555943508,
        lng:  4.929309666406198
      },
      {
        title: 'Поинт 4',
        lat: 52.3809553543508,
        lng: 4.939309666406198
      },
    ],
  },
  {
    city: 'Hamburg',
    markers: [
      {
        title: 'Поинт 1',
        lat: 52.3909553943508,
        lng: 4.85309666406198
      },
      {
        title: 'Поинт 2',
        lat: 52.369553943508,
        lng: 4.85309166406198
      },
      {
        title: 'Поинт 3',
        lat: 52.3901553943508,
        lng:  4.929109666406198
      },
      {
        title: 'Поинт 4',
        lat: 52.3809553143508,
        lng: 4.939309666401198
      },
    ],
  },
  {
    city: 'Dusseldorf',
    markers: [
      {
        title: 'Поинт 1',
        lat: 52.3909523943508,
        lng: 4.85309666406298
      },
      {
        title: 'Поинт 2',
        lat: 52.369553943508,
        lng: 4.85309666406198
      },
      {
        title: 'Поинт 3',
        lat: 52.3909554943508,
        lng:  4.929309636406198
      },
      {
        title: 'Поинт 4',
        lat: 52.3809553543508,
        lng: 4.939309636406198
      },
    ],
  },
];
